

def return_translate_anigma_name(self,anigma_name):
        translate_anigma_name={
            "ici":"מיקוד שליטה פנימי",
            "risc":"חוסן",
            "future_negetive_past":"התמקדות בחוויות טראומתיות מהעבר",
            "future_positive_past":"התמקדות בזכרונות חיוביים מהעבר",
            "future_fatalic_present":"תחושה של חוסר שליטה על העתיד",
            "future_hedonistic_present":"חיים והתמקדות בהווה ובהנאות של כאן ועכשיו גם במחיר ויתור על העתיד",
            "future_future":"תכנון לטווח הארוך והסתכלות קדימה"
        }
        return translate_anigma_name[anigma_name]


def return_translate_heg_name(heg_name):
    translate_heg_name={
    "heg_1": " יש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים 💪",
    "heg_2": " קורה לי הרבה שאני חושב/ת על דברים רעים שקרו לי 😞",
    "heg_3": " יש בי אמונה שאי אפשר באמת לתכנן את העתיד כי דברים משתנים כל הזמן 🤷‍♂️",
    "heg_4": "גם תחת לחץ, יש לי יכולת להשאר בפוקוס ולחשוב באופן בהיר 🔍",
    "heg_5": " מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן 😓",
    "heg_6": " יש לי נטייה להרגיש תחושות נעימות של נוסטלגיה כשאני נזכר בדברים שקרו לי בעבר 🌟",
    "heg_7": " תמיד אסיים את כל המטלות למחר לפני שאצא לבלות או לנוח בערב של אותו היום ⏰",
    "heg_8": "תמיד אעמוד בהבטחות שלי לחברים או לכל אחד אחר כמו המורה או ההורים שלי ✔️",
    "heg_9": " אני תמיד אשלים פרויקטים בזמן על ידי כך שאעשה כל פעם קצת במהלך הפרויקט ולא את הכל ברגע האחרון🕰️",
    "heg_10": "יש לי צורך שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי 🙌",
    "heg_11": " יש לי נטייה להסחף ברגע כשאני מתרגש/ת ממשהו😲",
    "heg_12": " כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה יש לי רצון לברר כל מה שאני יכול/ה על מה שקורה 🧐",
    "heg_13": "יש בעבר שלי הרבה זכרונות לא נעימים שהייתי שמח לא לחשוב עליהם 💔",
    "heg_14": " יש לי נטייה להתאושש במהירות לאחר מחלה, פציעה או כל קושי שאני נתקל בו 💪",
    "heg_15": " זה לא הגיוני לדאוג לגבי העתיד, כי בכל מקרה אין שום דבר שאני יכול/ה לעשות כדי להשפיע עליו😐",
    "heg_16": " קורה לי הרבה שעולים לי זכרונות נעימים מהעבר 🌸",
    "heg_17": "קשה לי לשכוח סיטואציות ומצבים לא נעימים מהילדות שלי 😔",
    "heg_18": " התמודדות עם לחץ וקושי יהפכו אותי לחזק/ה יותר.💥",
    "heg_19": "אני לא מתייאש/ת בקלות מכישלון. 🚫",
    "heg_20": " התגברתי בעבר על כשלונות כדי להגיע למטרות שהיו לי חשובות או משמעותיות 🌟",
    "heg_21": "אני מאוד אוהב/ת לשמוע סיפורים על העבר וללמוד מהם 📖",
    "heg_22": "הרבה דברים שאין לי שליטה עליהם משפיעים על מה שיקרה לי בחיים בהמשך מבחינת לימודים, עבודה וקריירה 🌍",
    "heg_23": " היו לי לא מעט דחיות וחוויות לא נעימות בעבר שלי ⚠️",
    "heg_24": "כשיש לי בעיה אני תמיד אקשיב לעצות של חברים או קרובי משפחה ואעשה מה שהם אומרים לי👂",
    "heg_25": " אני לוקח/ת סיכונים כדי למנוע מהחיים שלי להיות משעממים 🎢",
    "heg_26": " בכל פעם שמשהו טוב קורה לי יש לי הרגשה שזה קרה לי כי זה הגיע לי ✨",
    "heg_27": " יש לי יכולת לעמוד בפיתויים כשיש לי אחריות לבצע משימה🚫"
}    
    return translate_heg_name[heg_name]
